In [1]:
def call1(a,b,c):
    print(a,b,c)

In [3]:
call1(10,20,30)

10 20 30

In [8]:
def call2(a,b,c=50):
    print(a,b,c)

In [10]:
call2(10,2)#default매개변수 c=50을 미리 지정해 사용.

10 2 50

In [11]:
#Default매개변수는 반드시 뒤에 위치시켜야 한다.

In [12]:
def call4(a,b,c):
    print(a,b,c)

In [13]:
call4(a=100, c=200, b=300)#키워드 파라메터, 순서상관없음!!

100 300 200

In [15]:
##파이썬 오버라이딩은 지원함
##오버로딩은 지원하지 않는다.

##오버라이딩(재정의): 상속했을 때 자식클래스의 함수를 재정의하여 기능을 변경
##오버로딩(다형성): 하나의 이름으로 다양한 형태를 구현할 수 있는 기능

##public void add(int x ,int y)
##public void add(int x)

##자바는 하나의 함수 이름으로 다양한 입력값의 형태를 정의 가능
##자바는 오버로딩가능
##파이썬은 오버로딩 불가능.
##입력값으로 튜플과 딕셔너리를 여러개 넣을 수 있기 때문에 
##파이썬 함수의 입력값은 0~무한대의 개수를 가지게 정의 할 수 있다.
##가변 매개변수라고 부른다.

In [16]:
def call5(*a,b):
    print(a)
    print(b)

In [ ]:
#python.exe프로그램이 한 줄을 읽어서 실행을 바로 해준다.
#번역기 b=5라고 지정해줘야 오류안남!!

In [20]:
#call5((1,2,3),5)#이렇게쓰면 오류!!!
call5((1,2,3),b=5)#위치 가변 매개변수는 보통 단독으로 많이쓰임
#위치 가변 매개변수를 쓸 때는 
##다른 매개변수는 키워드(파라메터명)를 반드시 써주어야 헷갈리지 않는다.

((1, 2, 3),)
5

In [17]:
def call6(*a):
    print(a)

In [21]:
call6(1,2,3,4,5)#쉬프트텝누르면 자세하게 볼 수 있음.

(1, 2, 3, 4, 5)

In [23]:
call6(1,2,3,4,5,(1,2,3))

(1, 2, 3, 4, 5, (1, 2, 3))

In [26]:
call6(1,2,3,4,5,{'name':'hong'})

(1, 2, 3, 4, 5, {'name': 'hong'})

In [24]:
#파이썬에서는 파라메터의 개수가 정확히 몇개인지 확인하려면
##함수의 정의를 보고 확인해야한다.(shift+tab)

In [27]:
def call7(**kwargs):#kwargs=키워드아규먼트(키워드랑 같이쓰는 변수)라는 의미
    print(kwargs)

In [32]:
call7(name='hong', age=100)#키워드가변매개변수라고 부른다.

{'name': 'hong', 'age': 100}

In [33]:
call7(name='hong', age=100, tel='010')#키워드가변매개변수라고 부른다.

{'name': 'hong', 'age': 100, 'tel': '010'}

In [35]:
def call8(*tags,title,content,**kwargs):
    print('tag>>', tags)
    print('title>>', title)    
    print('content>>', content)    
    print('kwargs>>', kwargs)

In [36]:
##가변변수와 함께쓰는 일반변수는 키워드 변수로 사용해야한다.
##(변수명과 함께 써주어야한다.)

In [37]:
call8('바다','휴양지','쉼',
      title='제주도여행',
     content='해수욕장으로 고고!',
     location='제주도 북동부',#딕셔너리로들어감
     move='날아서')#딕셔너리로들어감

tag>> ('바다', '휴양지', '쉼')
title>> 제주도여행
content>> 해수욕장으로 고고!
kwargs>> {'location': '제주도 북동부', 'move': '날아서'}

In [38]:
##람다함수!

In [40]:
def call9(a):
    b = a-1
    return b

In [41]:
##일반 함수의 4대 조건
# 1.함수이름필요(입력값).call9(a)
# 2.함수 처리 내용 (a-1)
# 3.함수 처리 결과 리턴값(b)

##람다 함수의 4대 조건
# 1.입력값.
# 2.함수 처리 내용 필요
# 3.함수 처리 결과 리턴값

In [42]:
#[list comprehension]=> 익명함수의 일종

In [43]:
#lambda => 익명함수의 일종
lambda a:a-1

In [48]:
(lambda a:a-1)(10)#한번쓰고 끝남. 램에 저장안된다.메모리차지 안함!!

9

In [49]:
a_fun = (lambda a:a-1)

In [50]:
a_fun(10)

9

In [51]:
lambda a: True if a > 0 else False

In [52]:
true_fun=(lambda a: True if a > 0 else False)#if문 쓸 때 무조건else도 써줘야함
#함수에 넣어 깔끔하게 해주자.

In [53]:
true_fun(10)

True

In [70]:
#입력값이 양수이면 1, 음수면 0인 람다함수를 만들어보자.
one_fun =lambda a:1 if a >0 else 0

In [71]:
one_fun(100)

1

In [76]:
one_fun2 =lambda x:'양수' if x >0 else '음수'

In [77]:
one_fun2(-1)

'음수'

In [79]:
#one_fun을 일반함수로 바꿔보자.
def one_dfun(a):
    if a>0:
        return 1
    else:
        return 0

In [80]:
one_dfun(2)

1

In [ ]:
#one_fun2를 일반함수로 바꿔보자.

In [81]:
def one_dfun2(a):
    if a>0:
        return '양수'
    else:
        return '음수'

In [83]:
result = one_dfun2(-100)
result#이렇게 result변수에 넣어줘도 됨!

'음수'

In [59]:
#입력값을 2개 넣어, 더해보세요
#입력값이 2개의 리스트가 되도록 해보세요

In [60]:
ab_fun = lambda a,b: a+b #(잠깐쓸 변수명:처리할내용)

In [61]:
ab_fun(10,20)

30

In [85]:
#입력값이 2개의 리스트가 되도록 해보세요
a=[1,2,3]
b=[3,4,5]
ab_fun(a,b)

[1, 2, 3, 3, 4, 5]

In [86]:
#데이터 분석에 있어서 핵심은 df
#람다를 df를 다룰 때 어떻게 사용해야하는가?

In [1]:
##람다함수를 사용하는 이유
#1.메모리에 함수의 원형이 저장되지 않음
#2.일반함수보다 쉽고 간단

In [2]:
lambda x: x+1 #lambda 입력파라메터리스트: 처리내용반환

In [3]:
(lambda x: x+1)(10)

11

In [4]:
add = (lambda x: x+1)
add(100),add(101)

(101, 102)

In [5]:
list_data = [1,2,3]

In [10]:
map(add, list_data)#결과가 map객체, 사용할 수 없는 형태
## map함수는 많은 양의 데이터(예, 리스트)를 
##하나씩 꺼내서 함수를 map시켜 실행시켜준다.
##map함수의 결과는 무조건 map객체이므로,
##map함수의 결과를 사용하고자 하는 경우, list로 캐스팅 시켜준다.

In [11]:
list(map(add, list_data)) #하나씩 꺼내서 처리해서 맵핑해줘 라는 의미의 map함수

[2, 3, 4]

In [26]:
#입력값이 양수이면 '양수', 음수이면 '음수' 람다함수를 만들어보세요
fm_fun=lambda x:'양수' if x>0 else '음수' 
fm_fun(10)

'양수'

In [42]:
#fm_fun에 list 값을 넣어서 활용해보자.
#map함수를 이용!!!
fm_list=[1,-1,5,100,20]

In [43]:
result=list(map(fm_fun,fm_list))
result

['양수', '음수', '양수', '양수', '양수']

In [44]:
import numpy as np
import pandas as pd

In [48]:
df1 = pd.DataFrame({'name':['홍길동','김길동','홍순신','정길동','송사임'],
            'age':[100,200,10,20,30]})
df1

  name  age
0  홍길동  100
1  김길동  200
2  홍순신   10
3  정길동   20
4  송사임   30

In [49]:
df1['result'] = result
df1

  name  age result
0  홍길동  100     양수
1  김길동  200     음수
2  홍순신   10     양수
3  정길동   20     양수
4  송사임   30     양수

In [50]:
age_lambda = lambda x:'고령' if x>=200 else '보통'

In [51]:
list(map(age_lambda,df1['age'])) ## map(함수, 리스트형태의 자료구조)

['보통', '고령', '보통', '보통', '보통']

In [52]:
age_result = list(map(age_lambda,df1['age']))

In [53]:
df1['age_result'] = age_result
df1

  name  age result age_result
0  홍길동  100     양수         보통
1  김길동  200     음수         고령
2  홍순신   10     양수         보통
3  정길동   20     양수         보통
4  송사임   30     양수         보통

In [54]:
##람다함수를 만들어보세요
##name에 '홍'이라는 글자를 포함하고 있으면 1 아니면 0
##결과를 name_result 파생변수를 만들어보세요

In [70]:
name_fun = (lambda x:1 if '홍' in x  else 0)

In [79]:
'홍' in '홍길동'#in 문자열,리스트
#in의 결과는 bool이다.

True

In [80]:
1 in [1,2,3]# [1,2,3]에 1이 포함되는가 =>True

True

In [81]:
1 not in [1,2,3]

False

In [82]:
###참석확인하려고 하는 이름이 '홍길동'
###참석자리스트가 '김길동','정길동','송길동'
### 포함여부 확인용==> in, not in 오른쪽에는 왼쪽 값보다 포함관계가 더 큰 값이 와야한다.

In [84]:
'홍길동' in ['김길동','정길동','송길동']

False

In [101]:
#in 을 이용해 name_list에 내가 쓴 이름(input이용)이 있는지 확인해보자.

In [90]:
name_list = ['김길동','정길동','송길동']

In [93]:
name = input('확인하고싶은 이름입력:')

확인하고싶은 이름입력:아

In [95]:
if name in name_list:
    print('참석자이름에 있음')
else:   
    print('참석자이름에 없음')

참석자이름에 없음

In [96]:
#위 코드를 일반함수로 만들어보자.

In [97]:
def name_true(x):
    if x in name_list:
        print('참석자이름에 있음')
    else:
        print('참석자이름에 없음')

In [99]:
name_true('오진희')

참석자이름에 없음

In [100]:
name_true('김길동')

참석자이름에 있음

In [102]:
#람다함수로 만들어보자.

In [105]:
name_true1=lambda x:'참석자명단에있습니다.' if x in name_list else '참석자명단에 없습니다.'
name_true1('오')

'참석자명단에 없습니다.'

In [108]:
#find함수=> 찾고싶은 값이 있는지 확인하고 싶을 때 사용
'홍길동'.find('오')

-1

In [109]:
'홍길동'.find('홍')

0

In [149]:
#df에 컬럼 붙이기1.list(map()), 2.apply

In [74]:
name_result = list(map(name_fun, df1['name']))
name_result

[1, 0, 1, 0, 0]

In [75]:
df1['name_result'] = name_result
df1

  name  age result age_result  name_result
0  홍길동  100     양수         보통            1
1  김길동  200     음수         고령            0
2  홍순신   10     양수         보통            1
3  정길동   20     양수         보통            0
4  송사임   30     양수         보통            0

In [ ]:
#filter

In [112]:
name_result = list(filter(name_fun, df1['name']))
name_result
#map과 filter비교!
##map은 True/False의 결과를 모두다 return
##filter는 true의 결과를 return

['홍길동', '홍순신']

In [121]:
result=(lambda x:1 if x=='양수' else 0)

In [122]:
#df의 result변수의 값이 양수이면 1, 음수이면 0으로 바꿔보세요
df1['result'] = list(map(result, df1['result']))

In [123]:
df1

  name  age  result age_result  name_result
0  홍길동  100       1         보통            1
1  김길동  200       0         고령            0
2  홍순신   10       1         보통            1
3  정길동   20       1         보통            0
4  송사임   30       1         보통            0

In [124]:
#age_result의 값이 고령이면 1, 아니면 0으로 변경
#age를 100~200=>0,200~250=>1, 나머지는2

In [127]:
age_result = lambda x:1 if x=='고령' else 0

In [128]:
df1['age_result'] = list(map(age_result, df1['age_result']))
df1

  name  age  result  age_result  name_result
0  홍길동  100       1           0            1
1  김길동  200       0           1            0
2  홍순신   10       1           0            1
3  정길동   20       1           0            0
4  송사임   30       1           0            0

In [134]:
#age를 100~200=>0,200~250=>1, 나머지는2
#조건 2개 이상이면 아래처럼 일반함수로 쓰는것이 좋다.
def age_fun(x):
    if 100<=x<200:
        return 0
    elif 200<=x<250:
        return 1
    else:
        return 2

In [139]:
#mapping한 내용을 df1에 넣어보자.
age_fun_result = list(map(age_fun, df1['age']))
age_fun_result

[0, 1, 2, 2, 2]

In [140]:
df1['age']=age_fun_result

In [141]:
df1

  name  age  result  age_result  name_result
0  홍길동    0       1           0            1
1  김길동    1       0           1            0
2  홍순신    2       1           0            1
3  정길동    2       1           0            0
4  송사임    2       1           0            0

In [142]:
##apply함수(적용시키다)
## 컬럼명.apply(함수)

In [143]:
df1.columns

Index(['name', 'age', 'result', 'age_result', 'name_result'], dtype='object')

In [144]:
df1['age'].apply(lambda x:x+1)

0    1
1    2
2    3
3    3
4    3
Name: age, dtype: int64

In [146]:
df1['age']#apply는 비파괴함수이다.cpu에서만 반영 lam에 저장되지는 않았다.

0    0
1    1
2    2
3    2
4    2
Name: age, dtype: int64

In [147]:
df1['ageplus1']= df1['age'].apply(lambdad x:x+1)

In [148]:
df1

  name  age  result  age_result  name_result  ageplus1
0  홍길동    0       1           0            1         1
1  김길동    1       0           1            0         2
2  홍순신    2       1           0            1         3
3  정길동    2       1           0            0         3
4  송사임    2       1           0            0         3

In [150]:
##일반함수를 만들어 apply를 적용해보세요
##이름의 첫글자가 송으로 시작하면 '송', 아니면 첫글자에 해당하는 글자
##파생변수 name_apply

In [169]:
def change_name(x):
    if x[0]=='송':
        return '송'
    else:
        return x[0]

In [170]:
change_name('송사임')

'송'

In [171]:
df1['change_name']=df1['name'].apply(change_name)
#apply함수를 사용하면 if문 for문 안돌려도 되는 장점이 있다.

In [172]:
df1

  name  age  result  age_result  name_result  ageplus1 change_name
0  홍길동    0       1           0            1         1           홍
1  김길동    1       0           1            0         2           김
2  홍순신    2       1           0            1         3           홍
3  정길동    2       1           0            0         3           정
4  송사임    2       1           0            0         3           송